<!DOCTYPE html>
<html lang="ru">
<head>
    <!-- Весь предыдущий код остается без изменений до раздела <script> -->
    <script>
        // Элементы DOM
        const originalParagraph = document.getElementById('original-paragraph');
        const simplifiedText = document.getElementById('simplified-text');
        const progressBar = document.getElementById('progress-bar');
        const percentEl = document.getElementById('simplification-percent');
        const nextBtn = document.getElementById('next-btn');

        // Коллекция из 50 сложных текстов для упрощения
        const paragraphs = [
            {
                "text": "В современном мире, где скорость передачи информации достигла невероятных высот, человеческое сознание оказывается перегруженным постоянным потоком разрозненных данных, что неизбежно приводит к снижению способности к глубокому анализу и осмысленному восприятию действительности."
            },
            {
                "text": "Климатические изменения, наблюдаемые в последние десятилетия, демонстрируют устойчивую тенденцию к глобальному потеплению, которое влечет за собой цепь взаимосвязанных природных явлений, способных кардинально изменить привычные условия существования человеческой цивилизации."
            },
            {
                "text": "Принятие решений человеком представляет собой сложный процесс, в котором логическое мышление находится в постоянном взаимодействии с эмоциональной сферой, что часто приводит к неочевидным и противоречивым результатам."
            },
            {
                "text": "Современные технологии цифрового общения, предоставляя беспрецедентные возможности для установления контактов, одновременно создают новые формы социальной изоляции и дефицита живого человеческого взаимодействия."
            },
            {
                "text": "Экономические процессы в глобализированном мире характеризуются повышенной волатильностью, когда локальные события в одной точке земного шара могут спровоцировать масштабные последствия в совершенно других регионах."
            },
            {
                "text": "Образовательные системы сталкиваются с необходимостью фундаментального пересмотра традиционных подходов к передаче знаний в условиях, когда информация становится доступной мгновенно, а ее объемы удваиваются каждые несколько лет."
            },
            {
                "text": "Продолжительность жизни человека в развитых странах неуклонно растет, что ставит перед обществом новые вызовы, связанные с переосмыслением традиционных моделей пенсионного обеспечения и межпоколенческих отношений."
            },
            {
                "text": "Современные исследования человеческого мозга свидетельствуют о том, что его пластичность сохраняется на протяжении всей жизни, опровергая устоявшиеся представления о невозможности обучения в зрелом возрасте."
            },
            {
                "text": "Урбанизация как глобальный процесс приводит к формированию принципиально новых социальных структур, где традиционные формы сообществ уступают место сложным сетям временных и ситуативных связей."
            },
            {
                "text": "Развитие искусственного интеллекта порождает философские вопросы о природе человеческого сознания и границах между органическим и цифровым способами обработки информации."
            },
            {
                "text": "Продовольственная безопасность в условиях изменяющегося климата требует пересмотра существующих сельскохозяйственных практик и поиска новых подходов к производству продуктов питания."
            },
            {
                "text": "Современные исследования в области психологии демонстрируют, что многозадачность, вопреки распространенному мнению, снижает продуктивность и качество выполнения отдельных видов деятельности."
            },
            {
                "text": "Глобальные миграционные потоки создают сложные культурные ландшафты, где традиционные представления о национальной идентичности сталкиваются с новыми реалиями мультикультурного общества."
            },
            {
                "text": "Доступность кредитных ресурсов в современной экономике, с одной стороны, стимулирует потребление, а с другой - создает долгосрочные риски для финансовой стабильности отдельных домохозяйств."
            },
            {
                "text": "Принципы устойчивого развития требуют перехода от линейной модели экономики, основанной на постоянном потреблении, к циклической системе, где отходы становятся ресурсом для новых производственных циклов."
            },
            {
                "text": "Современные исследования сна свидетельствуют о его критической важности для процессов консолидации памяти и эмоциональной регуляции, что ставит под сомнение распространенную практику сознательного ограничения времени отдыха."
            },
            {
                "text": "Цифровизация повседневной жизни приводит к парадоксальной ситуации, когда технические средства, призванные экономить время, фактически увеличивают его дефицит за счет постоянного отвлечения внимания."
            },
            {
                "text": "Демографические изменения в развитых странах, связанные со снижением рождаемости и старением населения, требуют пересмотра традиционных моделей социального обеспечения."
            },
            {
                "text": "Современные исследования в области питания опровергают универсальные диетические рекомендации, демонстрируя значительные индивидуальные различия в метаболических реакциях на одни и те же продукты."
            },
            {
                "text": "Глобализация культурных процессов приводит к возникновению гибридных форм искусства, где традиционные элементы сочетаются с инновационными технологиями, создавая принципиально новые эстетические феномены."
            },
            {
                "text": "Современные системы образования сталкиваются с необходимостью развития навыков критического мышления в условиях, когда объем доступной информации превышает возможности ее осмысления."
            },
            {
                "text": "Психологические исследования показывают, что постоянное использование социальных сетей изменяет характер межличностных отношений, делая их более поверхностными и ситуативными."
            },
            {
                "text": "Развитие технологий удаленной работы создает новые возможности для трудовой деятельности, одновременно стирая границы между профессиональной и личной сферами жизни."
            },
            {
                "text": "Современные исследования городской среды демонстрируют значительное влияние архитектуры и планировки пространства на психологическое состояние и социальное поведение жителей."
            },
            {
                "text": "Глобальные экологические проблемы требуют координации действий на международном уровне, что сталкивается с противоречиями между национальными интересами и общепланетарными целями."
            },
            {
                "text": "Современные исследования в области психологии творчества показывают, что инновационные решения чаще возникают в условиях определенного уровня когнитивного диссонанса, а не стабильности."
            },
            {
                "text": "Развитие технологий искусственного интеллекта в сфере медицины открывает новые возможности диагностики, одновременно ставя этические вопросы о роли человеческого фактора в принятии врачебных решений."
            },
            {
                "text": "Современные экономические системы демонстрируют растущий разрыв между финансовыми рынками и реальным сектором экономики, что создает риски для устойчивого развития."
            },
            {
                "text": "Исследования в области поведенческой экономики показывают, что принятие финансовых решений часто основывается на иррациональных предпосылках, противоречащих классическим теориям рационального выбора."
            },
            {
                "text": "Глобализация образовательных процессов приводит к стандартизации учебных программ, что одновременно стирает культурные особенности и создает единое образовательное пространство."
            },
            {
                "text": "Современные исследования в области психологии восприятия демонстрируют, что цифровые технологии изменяют характер внимания, делая его более поверхностным и менее устойчивым."
            },
            {
                "text": "Развитие технологий генетического тестирования создает новые возможности для персонализированной медицины, одновременно поднимая сложные вопросы конфиденциальности и этического использования данных."
            },
            {
                "text": "Современные урбанистические исследования показывают, что качество городской среды оказывает прямое влияние на уровень удовлетворенности жизнью и психологическое благополучие жителей."
            },
            {
                "text": "Глобальные цепочки поставок, обеспечивающие эффективность современной экономики, одновременно создают уязвимости, которые становятся очевидными в условиях кризисных ситуаций."
            },
            {
                "text": "Исследования в области когнитивной науки демонстрируют, что процесс обучения наиболее эффективен при сочетании цифровых технологий с традиционными методами, а не при полном замещении одного другим."
            },
            {
                "text": "Современные тенденции в сфере труда показывают растущую ценность мягких навыков, таких как эмоциональный интеллект и способность к сотрудничеству, на фоне автоматизации технических операций."
            },
            {
                "text": "Развитие технологий виртуальной реальности создает новые формы образовательного и профессионального опыта, стирая границы между физическим и цифровым пространствами."
            },
            {
                "text": "Современные исследования в области социальной психологии демонстрируют, что групповое принятие решений часто приводит к поляризации мнений, а не к нахождению балансированных решений."
            },
            {
                "text": "Глобальные экологические изменения требуют переосмысления традиционных моделей потребления, основанных на идее безграничности природных ресурсов."
            },
            {
                "text": "Исследования в области нейробиологии показывают, что физическая активность оказывает прямое влияние на когнитивные функции и эмоциональное состояние, подтверждая взаимосвязь тела и сознания."
            },
            {
                "text": "Современные технологии коммуникации, обеспечивая мгновенную связь на больших расстояниях, одновременно изменяют характер человеческого общения, делая его более фрагментарным и менее глубоким."
            },
            {
                "text": "Развитие автоматизации и роботизации производственных процессов создает новые вызовы для рынка труда, требуя постоянного обновления профессиональных навыков."
            },
            {
                "text": "Современные исследования в области психологии счастья показывают, что уровень материального благосостояния оказывает ограниченное влияние на субъективное ощущение благополучия после достижения определенного порога."
            },
            {
                "text": "Глобализация культурного пространства приводит к смешению традиций и возникновению новых форм художественного выражения, которые не принадлежат ни одной конкретной культуре."
            },
            {
                "text": "Исследования в области поведенческой психологии демонстрируют, что привычки формируются и изменяются через сложное взаимодействие внешних стимулов и внутренних мотивационных факторов."
            },
            {
                "text": "Современные тенденции в медицине показывают растущее значение профилактического подхода, который фокусируется на сохранении здоровья, а не только на лечении заболеваний."
            },
            {
                "text": "Развитие технологий больших данных создает новые возможности для анализа социальных процессов, одновременно поднимая вопросы приватности и этического использования информации."
            },
            {
                "text": "Современные исследования в области когнитивного старения демонстрируют, что активная интеллектуальная деятельность может значительно замедлить возрастные изменения мозговых функций."
            },
            {
                "text": "Глобальные демографические тенденции указывают на постепенное сокращение населения в развитых странах, что потребует пересмотра существующих экономических моделей."
            },
            {
                "text": "Исследования в области социальных сетей показывают, что виртуальное общение не заменяет, а скорее дополняет традиционные формы взаимодействия, создавая новые социальные динамики."
            }
        ];

        let currentParagraphIndex = 0;

        // Показать текущий параграф
        function showCurrentParagraph() {
            originalParagraph.textContent = paragraphs[currentParagraphIndex].text;
            simplifiedText.value = '';
            updateProgress();
            simplifiedText.focus();
        }

        // Обновить прогресс
        function updateProgress() {
            const originalText = paragraphs[currentParagraphIndex].text;
            const simplifiedTextValue = simplifiedText.value;
            
            const originalLength = originalText.length;
            const simplifiedLength = simplifiedTextValue.length;
            const percent = simplifiedLength > 0 
                ? Math.max(0, Math.round((1 - simplifiedLength / originalLength) * 100))
                : 0;

            progressBar.style.width = `${percent}%`;
            percentEl.textContent = `${percent}%`;

            // Цвет прогресс-бара
            if (percent < 20) {
                progressBar.style.background = '#EF4444';
            } else if (percent < 40) {
                progressBar.style.background = '#F59E0B';
            } else {
                progressBar.style.background = 'linear-gradient(90deg, var(--primary), var(--secondary))';
            }
        }

        // Следующий параграф
        function nextParagraph() {
            currentParagraphIndex = (currentParagraphIndex + 1) % paragraphs.length;
            showCurrentParagraph();
        }

        // Инициализация
        showCurrentParagraph();

        // События
        simplifiedText.addEventListener('input', updateProgress);
        nextBtn.addEventListener('click', nextParagraph);

        // Горячие клавиши
        document.addEventListener('keydown', (e) => {
            if (e.ctrlKey && e.key === 'Enter') {
                nextParagraph();
            }
        });
    </script>
</body>
</html>
